app/controllers/activities_controller.rb

  def index
    @activities = Activity.find(:all, :order => "position")
---
SELECT * FROM "activities" WHERE (1 = 1) ORDER BY position DESC LIMIT 1

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("position", "created_at", "margin", "updated_at", "actual", "description", "estimate") VALUES(0, '2010-02-15 17:27:40', '', '2010-02-15 17:27:40', '', 'Make a basic Activity log', 7.0)

  def update
    @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 2)
UPDATE "activities" SET "updated_at" = '2010-04-15 10:50:16', "estimate" = 5.0, "actual" = 5.0, "margin" = '[Fri 12:00pm]', "description" = 'Drive to Great Lakes Ruby Bash' WHERE "id" = 1

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT * FROM "activities" WHERE ("activities"."id" = 980190962)
DELETE FROM "activities" WHERE "id" = 980190962